nxp-mcuxpresso/mcux-soc-svd/MCXN557S/MCXN557S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PDM</name>
      <description>MICFIL</description>
      <groupName>MICFIL</groupName>
      <baseAddress>0x4010C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDM_EVENT</name>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL_1</name>
          <description>MICFIL Control 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0EN</name>
              <description>Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1EN</name>
              <description>Channel 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2EN</name>
              <description>Channel 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3EN</name>
              <description>Channel 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSYNCEN</name>
              <description>Frame Synchronization Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECFILS</name>
              <description>Decimation Filter Enable in Stop</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stop</name>
                  <description>Stops decimation filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Keeps decimation filter running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERREN</name>
              <description>Error Interruption Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISEL</name>
              <description>DMA Interrupt Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>all_disabled</name>
                  <description>Disables DMA and interrupt requests</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmareq_enabled</name>
                  <description>Enables DMA requests</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>intreq_enabled</name>
                  <description>Enables interrupt requests</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGE</name>
              <description>Module Enable in Debug</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disables after completing the current frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enables operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRES</name>
              <description>Software Reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_action</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sw_reset</name>
                  <description>Software reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG</name>
              <description>Debug Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>debug</name>
                  <description>Debug</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMIEN</name>
              <description>MICFIL Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stopped</name>
                  <description>Stops MICFIL operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>started</name>
                  <description>Starts MICFIL operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEN</name>
              <description>Stop Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low_leakage</name>
                  <description>DLL mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_2</name>
          <description>MICFIL Control 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKDIV_0</name>
                  <description>Internal clock divider value = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_1</name>
                  <description>Internal clock divider value = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_249</name>
                  <description>...</description>
                  <value>0xF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_250</name>
                  <description>...</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_251</name>
                  <description>...</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_252</name>
                  <description>...</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_253</name>
                  <description>...</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_2_254</name>
                  <description>...</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV_255</name>
                  <description>Internal clock divider value = 255</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIVDIS</name>
              <description>Clock Divider Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CICOSR</name>
              <description>CIC Decimation Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CICOSR_0</name>
                  <description>CIC oversampling rate = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_1</name>
                  <description>CIC oversampling rate = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_2</name>
                  <description>...</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_12</name>
                  <description>...</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_13</name>
                  <description>...</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_2_14</name>
                  <description>...</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICOSR_15</name>
                  <description>CIC oversampling rate = 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QSEL</name>
              <description>Quality Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mq_mode</name>
                  <description>Medium-Quality mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hq_mode</name>
                  <description>High-Quality mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq2_mode</name>
                  <description>Very-Low-Quality 2 mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq1_mode</name>
                  <description>Very-Low-Quality 1 mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vlq0_mode</name>
                  <description>Very-Low-Quality 0 mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lq_mode</name>
                  <description>Low-Quality mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>MICFIL Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0F</name>
              <description>Channel 0 Output Data Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1F</name>
              <description>Channel 1 Output Data Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2F</name>
              <description>Channel 2 Output Data Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3F</name>
              <description>Channel 3 Output Data Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wm_notreached</name>
                  <description>Not surpassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wm_reached</name>
                  <description>Surpassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSY_FIL</name>
              <description>Busy Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stopped</name>
                  <description>MICFIL is stopped</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>running</name>
                  <description>MICFIL is running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
